Revit 2017 API
IExternalResourceUIServer.HandleBrowseResult Method
 Implement this method to handle browsing external resources operation result.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
void HandleBrowseResult(
	ExternalResourceUIBrowseResultType resultType,
	string browsingItemPath
)
Visual Basic
Sub HandleBrowseResult ( _
	resultType As ExternalResourceUIBrowseResultType, _
	browsingItemPath As String _
)
Visual C++
void HandleBrowseResult(
	ExternalResourceUIBrowseResultType resultType,
	String^ browsingItemPath
)
Parameters
resultType
Type: Autodesk.Revit.DB.ExternalResourceUIBrowseResultType
 The result of browsing operation.
browsingItemPath
Type: System.String
 The absolute path of item which is browsing.
Remarks
 This method will be called automatically when users browsing external resources, such as list folders and resources of an external server or a foler, or open an external resource in browsing dialog.
See Also
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace